src/DataProcessors/ЗагрузкаДанныхИзТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхИзТСД</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СкидкиВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СкидкиВОборудовании</Name>
			<Comment>Сведения о скидках которые выгружаются в оборудование</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения товара. Если момент больше чем "момент последней загрузки" оборудования, то этот товар надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагВытеснения</Name>
					<Comment>Флаг вытеснения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкидкиВОборудовании</Name>
					<Comment>Идентификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольнаяСуммаНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоставНабора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДниНедели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило расчета скидки по количеству</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаРасчетаСкидкиПоКоличеству</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаНакопления</Name>
					<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяСкидка</Name>
					<Comment>Истина, если скидка задается в ручную. Ложь, если скидка автоматическая</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Свойство документа, от которого зависить скидка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачВремя</Name>
					<Comment>Время начала действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонВремя</Name>
					<Comment>Время окончания действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ДанныеТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеТСД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество единиц измерения номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатуры для контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРозничная</Name>
					<Comment>Розничная цена номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиПоНакладной</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоНакладной</Name>
					<Comment>Количество единиц номенклатуры по накладной</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запас</Name>
					<Comment>Количество единиц номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика/серия номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СкидкиСпособВычисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СкидкиСпособВычисления</Name>
			<Comment>Способ вычисления</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютная</Name>
					<Comment>Абсолютная скидка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относительная</Name>
					<Comment>Относительная скидка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяЦена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ЗагрузкаДанныхИзТСД/Forms/СборДанных/Ext/Form/Module.bsl
&НаСервере
Процедура ОчиститьПоля()
	
	Номенклатура               = Неопределено;
	ХарактеристикаНоменклатуры = Неопределено;
	Единица                    = Неопределено;
	ВладелецЕдиницыИзмерения   = Неопределено;
	ВладелецХарактеристики     = Неопределено;
	Количество            = 0;
	КоличествоПоНакладной = 0;
	Коэффициент           = 0;
	НакопленноеКоличество = 0;
	НомерСтрокиПоНакладной           = 0;
	Цена                  = 0;
	Сумма                 = 0;
	ЦенаРозничная         = 0;
	СуммаРозничная        = 0;
	Осталось              = 0;
	Запас                 = 0;
	ПредставлениеНоменклатуры = "";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуСУчетомФиксированнойЦены(Номенклатура)
	
	Результат = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиВОборудовании.ЗначениеСкидки
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	&Момент МЕЖДУ СкидкиВОборудовании.НачалоДействия И СкидкиВОборудовании.КонецДействия
	|	И СкидкиВОборудовании.Номенклатура = &Номенклатура
	|	И СкидкиВОборудовании.Скидка = &Скидка
	|	И СкидкиВОборудовании.СпособВычисления = &СпособВычисления
	|	И СкидкиВОборудовании.Действует = Истина
	|УПОРЯДОЧИТЬ ПО
	|	СкидкиВОборудовании.НачалоДействия УБЫВ,
	|	СкидкиВОборудовании.КонецДействия");
	
	Запрос.УстановитьПараметр("Момент",           ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура",     Номенклатура);
	Запрос.УстановитьПараметр("Скидка",           Справочники.ТипыСкидок.СкидкаНаТовар);
	Запрос.УстановитьПараметр("СпособВычисления", Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЗначениеСкидки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЦены()
	
	Цена  = ЦенообразованиеСервер.ПолучитьЦену(ТипЦен, Номенклатура,, Контрагент, Валюта, КурсВалюты, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ПодразделениеКомпании);
	Сумма = Цена*Количество;
	
	Если ЗначениеЗаполнено(ТипЦенРозничный) Тогда
		ЦенаРозничная = ПолучитьЦенуСУчетомФиксированнойЦены(Номенклатура);
		Если ЦенаРозничная = 0 Тогда
			ЦенаРозничная = ЦенообразованиеСервер.ПолучитьЦену(ТипЦенРозничный, Номенклатура,, , Валюта, КурсВалюты, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ПодразделениеКомпании);
		КонецЕсли;
		СуммаРозничная = ЦенаРозничная*Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоля(РезультатПоиска)
	
	НоменклатураПредставление = РезультатПоиска.Номенклатура.Наименование;
	//Элементы.НоменклатураНачало.Заголовок = "[" + Штрихкод + "] "+Лев(СокрЛП(НоменклатураПредставление),25);
	//Элементы.НоменклатураПродолжение.Заголовок = Сред(СокрЛП(НоменклатураПредставление),26);
	ПредставлениеНоменклатуры = "[" + СтрокаШтрихкода + "] "+Лев(СокрЛП(НоменклатураПредставление),25) + Символы.ПС + Сред(СокрЛП(НоменклатураПредставление),26);
	
	Номенклатура               = РезультатПоиска.Номенклатура;
	ЕдиницаИзмерения           = ?(ЗначениеЗаполнено(РезультатПоиска.ЕдиницаИзмерения), РезультатПоиска.ЕдиницаИзмерения, Номенклатура.ОсновнаяЕдиницаИзмерения);
	Коэффициент                = ЕдиницаИзмерения.Коэффициент;
	ХарактеристикаНоменклатуры = РезультатПоиска.ХарактеристикаНоменклатуры;
	Количество                 = РезультатПоиска.Количество*Коэффициент;
	Если РезультатПоиска.ИзКэша Тогда
		НакопленноеКоличество  = РезультатПоиска.НакопленноеКоличество;
		КоличествоПоНакладной  = РезультатПоиска.КоличествоПоНакладной;
		Осталось               = КоличествоПоНакладной - (НакопленноеКоличество + Количество);
		Цена                   = РезультатПоиска.Цена;
		ЦенаРозничная          = РезультатПоиска.ЦенаРозничная;
		НомерСтрокиПоНакладной = РезультатПоиска.НомерСтрокиПоНакладной;
		Запас                  = РезультатПоиска.Запас;
	Иначе
		Если НЕ ПолучитьДанныеДокумента() Тогда
			ЗаполнитьЦены();
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, Номенклатура = &Номенклатура И СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки");
		Запрос.УстановитьПараметр("Номенклатура",  Номенклатура);
		Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Запас = Выборка.Остаток;
		КонецЕсли;
	КонецЕсли;
	
	Осталось       = КоличествоПоНакладной - (НакопленноеКоличество + Количество);
	Сумма          = Цена*Количество;
	СуммаРозничная = ЦенаРозничная*Количество;
	
	ТипНоменклатуры = Номенклатура.ТипНоменклатуры;
	
	ИспользованиеЕдиницИзмерения = ТипНоменклатуры.ИспользованиеЕдиницИзмерения;
	ИспользованиеХарактеристик   = ТипНоменклатуры.ИспользованиеХарактеристик;
	
	Если ИспользованиеЕдиницИзмерения = 1 Тогда
		ВладелецЕдиницыИзмерения = ТипНоменклатуры;
	ИначеЕсли ИспользованиеЕдиницИзмерения = 2 Тогда
		ВладелецЕдиницыИзмерения = Номенклатура;
	Иначе
		ВладелецЕдиницыИзмерения = Неопределено;
	КонецЕсли;
	
	Если ИспользованиеХарактеристик = 1 Тогда
		ВладелецХарактеристики = ТипНоменклатуры;
	ИначеЕсли ИспользованиеХарактеристик = 2 Тогда
		ВладелецХарактеристики = Номенклатура;
	Иначе
		ВладелецХарактеристики = Неопределено;
	КонецЕсли;
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.Количество;
	
КонецПроцедуры
//&НаСервере
//Процедура ЗаполнитьПоляПоДокументуОснованию(ДокументОснование)
//	
//	Для Каждого Строка Из ДокументОснование.Товары Цикл
//		
//		//ПредставлениеНоменклатуры = "[" + Строка.Номенклатура + "] "+Лев(СокрЛП(Строка.Номенклатура),25) + Символы.ПС + Сред(СокрЛП(Строка.Номенклатура),26);
//		
//		Номенклатура               = Строка.Номенклатура;
//		ЕдиницаИзмерения           = ?(ЗначениеЗаполнено(Строка.ЕдиницаИзмерения), Строка.ЕдиницаИзмерения, Строка.ОсновнаяЕдиницаИзмерения);
//		Коэффициент                = Строка.Коэффициент;
//		ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры;
//		Количество                 = Строка.Количество*Коэффициент;
//		Цена                       = Строка.Цена;
//		Сумма                      = Цена*Количество;
//		Штрихкод                   = ШтрихкодированиеВызовСервера.ПолучитьШтрихКодОбъекта(Номенклатура);
//		ТипНоменклатуры 		   = Номенклатура.ТипНоменклатуры;
//		
//		ИспользованиеЕдиницИзмерения = ТипНоменклатуры.ИспользованиеЕдиницИзмерения;
//		ИспользованиеХарактеристик   = ТипНоменклатуры.ИспользованиеХарактеристик;
//		
//		Если ИспользованиеЕдиницИзмерения = 1 Тогда
//			ВладелецЕдиницыИзмерения = ТипНоменклатуры;
//		ИначеЕсли ИспользованиеЕдиницИзмерения = 2 Тогда
//			ВладелецЕдиницыИзмерения = Номенклатура;
//		Иначе
//			ВладелецЕдиницыИзмерения = Неопределено;
//		КонецЕсли;
//		
//		Если ИспользованиеХарактеристик = 1 Тогда
//			ВладелецХарактеристики = ТипНоменклатуры;
//		ИначеЕсли ИспользованиеХарактеристик = 2 Тогда
//			ВладелецХарактеристики = Номенклатура;
//		Иначе
//			ВладелецХарактеристики = Неопределено;
//		КонецЕсли;
//		СохранитьРезультатНаСервере()
//	КонецЦикла;
//	ЭтотОбъект.ТекущийЭлемент = Элементы.Количество;
//	
//КонецПроцедуры


&НаСервере
Процедура СформироватьЗаголовкиФормы()
	
	Если ВидДокумента = "ПоступлениеТоваров" Тогда
		Заголовок = "Сбор по поступлению";
	ИначеЕсли ВидДокумента = "ПеремещениеТоваров" Тогда
		Заголовок = "Сбор по перемещению";
	ИначеЕсли ВидДокумента = "Инвентаризация" Тогда
		Заголовок = "Сбор по инвентаризации";
	ИначеЕсли ВидДокумента = "СписаниеТоваров" Тогда
		Заголовок = "Сбор по списанию";
	ИначеЕсли ВидДокумента = "ВозвратПоставщику" Тогда
		Заголовок = "Сбор по возврату";
	КонецЕсли;
	
	Если ДокументЗаполнения = Неопределено Тогда
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Элементы.ПредставлениеДокумента.Заголовок = "Док: НОВЫЙ, Склад: " + Строка(СкладКомпании) + ", Основание" + Строка(ДокументОснование);
		Иначе
			Элементы.ПредставлениеДокумента.Заголовок = "Док: НОВЫЙ, Склад: " + Строка(СкладКомпании);
		КонецЕсли;
	ИначеЕсли ВидДокумента = "ПоступлениеТоваров" Тогда
		Элементы.ПредставлениеДокумента.Заголовок = "Док:" + ДокументЗаполнения.Номер+" от " + Формат(ДокументЗаполнения.Дата,"ДФ=dd.MM.yy")+", Контрагент: " + ДокументЗаполнения.Контрагент;
	ИначеЕсли ВидДокумента = "ПеремещениеТоваров" Тогда
		Элементы.ПредставлениеДокумента.Заголовок = "Док:" + ДокументЗаполнения.Номер+" от " + Формат(ДокументЗаполнения.Дата,"ДФ=dd.MM.yy")+", Склад: " + ДокументЗаполнения.СкладКомпании;
	ИначеЕсли ВидДокумента = "Инвентаризация" Тогда
		Элементы.ПредставлениеДокумента.Заголовок = "Док:" + ДокументЗаполнения.Номер+" от " + Формат(ДокументЗаполнения.Дата,"ДФ=dd.MM.yy")+", Склад: " + ДокументЗаполнения.СкладКомпании;
	ИначеЕсли ВидДокумента = "СписаниеТоваров" Тогда
		Элементы.ПредставлениеДокумента.Заголовок = "Док:" + ДокументЗаполнения.Номер+" от " + Формат(ДокументЗаполнения.Дата,"ДФ=dd.MM.yy")+", Склад: " + ДокументЗаполнения.СкладКомпании;
	ИначеЕсли ВидДокумента = "ВозвратПоставщику" Тогда
		Элементы.ПредставлениеДокумента.Заголовок = "Док:" + ДокументЗаполнения.Номер+" от " + Формат(ДокументЗаполнения.Дата,"ДФ=dd.MM.yy")+", Контрагент: " + ДокументЗаполнения.Контрагент;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДокумента()
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(ДокументЗаполнения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровТовары.НомерСтроки,
	|	ПоступлениеТоваровТовары.Коэффициент,
	|	ПоступлениеТоваровТовары.Цена," + ?(ВидДокумента = "ВозвратПоставщику", "
	|	0 КАК ЦенаРозничная,", "
	|	ПоступлениеТоваровТовары.ЦенаРозничная,") + ?(ВидДокумента = "Инвентаризация", "
	|	ПоступлениеТоваровТовары.КоличествоФакт*ПоступлениеТоваровТовары.Коэффициент КАК Количество", "
	|	ПоступлениеТоваровТовары.Количество*ПоступлениеТоваровТовары.Коэффициент КАК Количество") + "
	|ИЗ
	|	Документ."+ВидДокумента+".Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Ссылка И 
	|	ПоступлениеТоваровТовары.Номенклатура = &Номенклатура И 
	|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры И 
	|	ПоступлениеТоваровТовары.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|";
	Запрос.УстановитьПараметр("Ссылка",                     ДокументЗаполнения);
	Запрос.УстановитьПараметр("Номенклатура",               Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",           ЕдиницаИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Коэффициент            = Выборка.Коэффициент;
		Цена                   = Выборка.Цена;
		ЦенаРозничная          = Выборка.ЦенаРозничная;
		НомерСтрокиПоНакладной = Выборка.НомерСтроки;
		КоличествоПоНакладной  = Выборка.Количество;
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиВДанныхТСД(Штрихкод, ИдентификаторОбъекта, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДанныеТСД.Номенклатура КАК Номенклатура,
	|	ДанныеТСД.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеТСД.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеТСД.Количество КАК Количество,
	|	ДанныеТСД.Цена,
	|	ДанныеТСД.ЦенаРозничная,
	|	ДанныеТСД.НомерСтрокиПоНакладной,
	|	ДанныеТСД.КоличествоПоНакладной,
	|	ДанныеТСД.Запас
	|ИЗ
	|	РегистрСведений.ДанныеТСД КАК ДанныеТСД
	|ГДЕ
	|	ДанныеТСД.ИдентификаторОбъекта = &ИдентификаторОбъекта И 
	|	ДанныеТСД.Штрихкод = &Штрихкод" + ?(ХарактеристикаНоменклатуры = Неопределено, "", " И 
	|	ДанныеТСД.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры") + ?(ЕдиницаИзмерения = Неопределено, "", " И 
	|	ДанныеТСД.ЕдиницаИзмерения = &ЕдиницаИзмерения") + "
	|";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта",       ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("Штрихкод",                   Штрихкод);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",           ЕдиницаИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Номенклатура",               Выборка.Номенклатура);
		Результат.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
		Результат.Вставить("ЕдиницаИзмерения",           Выборка.ЕдиницаИзмерения);
		Результат.Вставить("НакопленноеКоличество",      Выборка.Количество);
		Результат.Вставить("Цена",                       Выборка.Цена);
		Результат.Вставить("ЦенаРозничная",              Выборка.ЦенаРозничная);
		Результат.Вставить("НомерСтрокиПоНакладной",     Выборка.НомерСтрокиПоНакладной);
		Результат.Вставить("КоличествоПоНакладной",      Выборка.КоличествоПоНакладной);
		Результат.Вставить("Запас",                      Выборка.Запас);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиПоКоду(Код)
	
	Результат = Неопределено;
	
	КодНоменклатуры = СокрЛП(Код);
	Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
	Если НЕ Номенклатура = Неопределено Тогда
		Результат = Номенклатура;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиПоАртикулу(Артикул)
	
	Результат = Неопределено;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул ПОДОБНО &Артикул";
	Запрос.УстановитьПараметр("Артикул", "%"+Артикул);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоШтрихкоду(Штрихкод, ДлинаКода, ИдентификаторОбъекта)
	
	ПрефиксВесовогоШК = Константы.ПрефиксВесовогоШК.Получить();
	
	Вес = 0;
	Если Лев(Штрихкод,2) = Строка(ПрефиксВесовогоШК) Тогда
		// Вытащим вес
		Вес = Сред(Штрихкод, 8, СтрДлина(Штрихкод)-8);
		Если ЗначениеЗаполнено(Вес) Тогда
			Вес = Число(Вес)/1000;
		Иначе
			Вес = 0;
		КонецЕсли;
	КонецЕсли;
	
	РезультатПоиска = НайтиВДанныхТСД(Штрихкод, ИдентификаторОбъекта);
	Если РезультатПоиска = Неопределено Тогда
		РезультатПоиска = Новый Структура;
		РезультатПоиска.Вставить("ИзКэша", Ложь);
	Иначе
		РезультатПоиска.Вставить("Количество", Вес);
		РезультатПоиска.Вставить("ИзКэша", Истина);
		Возврат РезультатПоиска;
	КонецЕсли;
	
	РезультатПоиска.Вставить("Номенклатура",               Справочники.Номенклатура.ПустаяСсылка());
	РезультатПоиска.Вставить("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	РезультатПоиска.Вставить("ЕдиницаИзмерения",           Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	РезультатПоиска.Вставить("Количество",                 Вес);
	РезультатПоиска.Вставить("НакопленноеКоличество",        0);
	
	//сначала поищем по коду
	Объект = НайтиПоКоду(Штрихкод);
	Если ЗначениеЗаполнено(Объект) Тогда
		Если НЕ Объект.ЭтоГруппа Тогда
			РезультатПоиска.Вставить("Номенклатура", Объект);
			Возврат РезультатПоиска;
		КонецЕсли;
	КонецЕсли;
	//сначала поищем по Артикулу
	Объект = НайтиПоАртикулу(Штрихкод);
	Если ЗначениеЗаполнено(Объект) Тогда
		Если НЕ Объект.ЭтоГруппа Тогда
			РезультатПоиска.Вставить("Номенклатура", Объект);
			Возврат РезультатПоиска;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	Результат = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкод);
	
	//Если Результат.Количество() = 0 Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить номенклатуру по штрихкоду");
	//	Возврат;
	//КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Результат Цикл
		Если НЕ ТипЗнч(ТекущаяСтрока.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.Запрет Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатПоиска.Вставить("Номенклатура",               ТекущаяСтрока.Объект);
		РезультатПоиска.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
		РезультатПоиска.Вставить("ЕдиницаИзмерения",           ТекущаяСтрока.ЕдиницаИзмерения);
		
		Прервать;
	КонецЦикла;
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Процедура ОбработатьШтрихкодНоменклатурыНаСервере()
	
	ОчиститьПоля();
	
	РезультатПоиска = ПолучитьДанныеПоШтрихкоду(СтрокаШтрихкода, ДлинаКода, ИдентификаторОбъекта);
	
	Если НЕ ЗначениеЗаполнено(РезультатПоиска.Номенклатура) Тогда
		//Элементы.НоменклатураНачало.Заголовок = "[" + СтрокаШтрихкода + "] Номенклатура не найдена";
		ПредставлениеНоменклатуры = "[" + СтрокаШтрихкода + "] Номенклатура не найдена";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить номенклатуру по штрихкоду");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоля(РезультатПоиска);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидДокумента = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВидДокумента", "ПоступлениеТоваров");
	ДокументЗаполнения 	= ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументЗаполнения", Неопределено);
	//ДокументОснование 	= ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументОснование", Неопределено);

	
	Если ДокументЗаполнения = Неопределено Тогда
		ВремИдентификаторОбъекта = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ИдентификаторОбъекта", "");
		ДокументОснование     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументОснование", Неопределено);
		Если ЗначениеЗаполнено(ВремИдентификаторОбъекта) Тогда
			ИдентификаторОбъекта = ВремИдентификаторОбъекта;
		ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
			ИдентификаторОбъекта = ДокументОснование.УникальныйИдентификатор();
		Иначе
			ИдентификаторОбъекта = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		СкладКомпании         = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СкладКомпании", Неопределено);
		Элементы.ГруппаОсталось.Видимость = Ложь;
	Иначе
		СкладКомпании         = ДокументЗаполнения.СкладКомпании;
		ПодразделениеКомпании = ДокументЗаполнения.ПодразделениеКомпании;
		Контрагент            = ДокументЗаполнения.Контрагент;
		ИдентификаторОбъекта  = ДокументЗаполнения.УникальныйИдентификатор();
		Элементы.ГруппаОсталось.Видимость = Истина;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(ДокументЗаполнения) И ЗначениеЗаполнено(ДокументОснование) Тогда
	//	ЗаполнитьПоляПоДокументуОснованию(ДокументОснование);
	//КонецЕсли;
	
	СформироватьЗаголовкиФормы();
	
	ДлинаКода = Метаданные.Справочники.Номенклатура.ДлинаКода;
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Артикул.Тип = "Строка" Тогда
		ДлинаАртикула = Метаданные.Справочники.Номенклатура.Реквизиты.Артикул.Тип.КвалификаторыЧисла.Разрядность;
	Иначе
		ДлинаАртикула = Метаданные.Справочники.Номенклатура.Реквизиты.Артикул.Тип.КвалификаторыСтроки.Длина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СкладКомпании.ТипЦенСебестоимости) Тогда
		ТипЦен = СкладКомпании.ТипЦенСебестоимости;
	Иначе
		ТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки");
	КонецЕсли;
	
	Если СкладКомпании.Розничный Тогда
		ТипЦенРозничный = СкладКомпании.ТипЦенРозничнойТорговли;
		Элементы.ГруппаЦенаРозничная.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЦенаРозничная.Видимость = Истина;
	КонецЕсли;
	
	Валюта         = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ТекущаяДатаСеанса());
	КурсВалюты     = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСбор(Команда)
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		СохранитьРезультатНаСервере();
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента",         ВидДокумента);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
	ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения",   ДокументЗаполнения);
	ПараметрыОткрытияФормы.Вставить("СкладКомпании",        СкладКомпании);
	ПараметрыОткрытияФормы.Вставить("ДокументОснование",    ДокументОснование);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.ПросмотрРезультата", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутсяНазад(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента", ВидДокумента);
	Если НЕ ДокументЗаполнения = Неопределено Тогда
		ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения", ДокументЗаполнения);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.ВыборДокумента", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаШтрихкодаПриИзменении(Элемент)
	
	СтрокаШтрихкода = СокрЛП(СтрокаШтрихкода);
	
	Если ПустаяСтрока(СтрокаШтрихкода) Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.СтрокаШтрихкода;
		Возврат;
	КонецЕсли;
	
	ОбработатьШтрихкодНоменклатурыНаСервере();
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);
	КонецЕсли;
	
	Штрихкод = СтрокаШтрихкода;
	СтрокаШтрихкода = "";
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПозициюНаШтрихкод()
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаРозничнаяПриИзменении(Элемент)
	
	СуммаРозничная = ЦенаРозничная*Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Сумма = Цена*Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Осталось       = КоличествоПоНакладной - (НакопленноеКоличество + Количество);
	Сумма          = Цена*Количество;
	СуммаРозничная = ЦенаРозничная*Количество;
	
КонецПроцедуры

&НаСервере
Процедура ПоискКэшаДанныхИСтрокиДокумента()
	
	РезультатПоиска = НайтиВДанныхТСД(СтрокаШтрихкода, ИдентификаторОбъекта, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
	Если РезультатПоиска = Неопределено Тогда
		ПолучитьДанныеДокумента();
	Иначе
		НакопленноеКоличество  = РезультатПоиска.НакопленноеКоличество;
		КоличествоПоНакладной  = РезультатПоиска.КоличествоПоНакладной;
		Осталось               = КоличествоПоНакладной - (НакопленноеКоличество + Количество);
		Цена                   = РезультатПоиска.Цена;
		ЦенаРозничная          = РезультатПоиска.ЦенаРозничная;
		НомерСтрокиПоНакладной = РезультатПоиска.НомерСтрокиПоНакладной;
		Запас                  = РезультатПоиска.Запас;
	КонецЕсли;
	
	Осталось = КоличествоПоНакладной - (НакопленноеКоличество + Количество);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоэффициент(ЕдиницаИзмерения)
	
	Возврат ЕдиницаИзмерения.Коэффициент;
	
КонецФункции

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтарыйКоэффициент = Коэффициент;
	Коэффициент       = ПолучитьКоэффициент(ЕдиницаИзмерения);
	
	Если НЕ СтарыйКоэффициент = Коэффициент Тогда
		Количество = Количество/СтарыйКоэффициент*Коэффициент;
		КоличествоПриИзменении(Элемент);
	КонецЕсли;
	
	ПоискКэшаДанныхИСтрокиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	ПоискКэшаДанныхИСтрокиДокумента();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.СтрокаШтрихкода;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Штрихкод) Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.СтрокаШтрихкода;
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписиДанныеТСД = РегистрыСведений.ДанныеТСД.СоздатьМенеджерЗаписи();
	МенеджерЗаписиДанныеТСД.ИдентификаторОбъекта       = ИдентификаторОбъекта;
	МенеджерЗаписиДанныеТСД.Штрихкод                   = Штрихкод;
	МенеджерЗаписиДанныеТСД.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	МенеджерЗаписиДанныеТСД.ЕдиницаИзмерения           = ЕдиницаИзмерения;
	
	НачатьТранзакцию();
	МенеджерЗаписиДанныеТСД.Прочитать();
	Если НЕ МенеджерЗаписиДанныеТСД.Выбран() Тогда
		МенеджерЗаписиДанныеТСД.ИдентификаторОбъекта       = ИдентификаторОбъекта;
		МенеджерЗаписиДанныеТСД.Штрихкод                   = Штрихкод;
		МенеджерЗаписиДанныеТСД.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		МенеджерЗаписиДанныеТСД.ЕдиницаИзмерения           = ЕдиницаИзмерения;
		МенеджерЗаписиДанныеТСД.Запас                      = Запас;
		МенеджерЗаписиДанныеТСД.Номенклатура               = Номенклатура;
		МенеджерЗаписиДанныеТСД.НомерСтрокиПоНакладной     = НомерСтрокиПоНакладной;
		МенеджерЗаписиДанныеТСД.КоличествоПоНакладной      = КоличествоПоНакладной;
	КонецЕсли;
	МенеджерЗаписиДанныеТСД.Цена          = Цена;
	МенеджерЗаписиДанныеТСД.ЦенаРозничная = ЦенаРозничная;
	МенеджерЗаписиДанныеТСД.Количество    = МенеджерЗаписиДанныеТСД.Количество + Количество;
	
	МенеджерЗаписиДанныеТСД.Записать(Истина);
	ЗафиксироватьТранзакцию();
	
	Штрихкод = "";
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
	ТекстСообщения = НСтр("ru='Добавлена номенклатура ""%ОписаниеНоменклатуры%"".'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеНоменклатуры%" , СокрЛП(ПредставлениеНоменклатуры));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументЗаполнения);
	
	ОчиститьПоля();
	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРезультат(Команда)
	
	СохранитьРезультатНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Источник = "Сканер" Тогда
		СтрокаШтрихкода = Данные;
		СтрокаШтрихкодаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры
